Revit 2027 API
BuiltInFailures.ViewFailures.DetailNumberDuplicate Property
 Detail Number is already in use. Enter a unique number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DetailNumberDuplicate { get; }
Public Shared ReadOnly Property DetailNumberDuplicate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DetailNumberDuplicate {
	FailureDefinitionId^ get ();
}
static member DetailNumberDuplicate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace